---
title: EnergyAnalysisWindowType
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# EnergyAnalysisWindowType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Description { get; }` | `energyAnalysisWindowType.Description` | String |
| `Double HeatTransferCoefficient { get; }` | `energyAnalysisWindowType.HeatTransferCoefficient` | Double |
| `Boolean IsSchematic { get; }` | `energyAnalysisWindowType.IsSchematic` | Boolean |
| `Double SolarHeatGainCoefficient { get; }` | `energyAnalysisWindowType.SolarHeatGainCoefficient` | Double |
| `Double Transmittance { get; }` | `energyAnalysisWindowType.Transmittance` | Double |
| `String WindowTypeName { get; }` | `energyAnalysisWindowType.WindowTypeName` | String |
| `IDictionary<Double, Double> GetSolarHeatGainCoefficientsForSolarIndicientAngles()` | `energyAnalysisWindowType.GetSolarHeatGainCoefficientsForSolarIndicientAngles()` | IDictionary<Double, Double> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```